/**
 * @license
 * Copyright 2020 Константин Поляков
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @fileoverview Робот-Blockly, циклы с условием
 * @author kpolyakov@mail.ru (Константин Поляков)
 * @web    kpolyakov.spb.ru
 */

//======================= MAPS =======================
// Карта должна быть размером 10 на 10 клеток
// Условные обозначения:
//    . пустая клетка
//    w стена
//    p клумба с цветами
//    x грядка, в которую нужно посадить цветы
//    0 клетка, в которой находится Робот, смотрит на север 
//    2 клетка, в которой находится Робот, смотрит на восток 
//    4 клетка, в которой находится Робот, смотрит на юг
//    6 клетка, в которой находится Робот, смотрит на запад
//    X клетка-грядка, в которой находится Робот, смотрит на север

var Maps = 
 [ [], // Level 0 - not used  
//--- Level 1 ----------------------------------------------------
[ 
  ['..........',  // Level 2-1
   '........w.',
   '........w.',
   '........w.',
   '........w.',
   '.0.....bw.',
   '........w.',
   '........w.',
   '........w.',
   '..........' ],
  ['..........',  // Level 2-2
   '........w.',
   '........w.',
   '........w.',
   '.wwwwwwww.',
   '....0..bw.',
   '........w.',
   '........w.',
   '........w.',
   '..........' ],
  ['..........',  // Level 2-3
   '........w.',
   '.....wwww.',
   '..wwww..w.',
   '.....w..w.',
   '......0bw.',
   '.wwwwwwww.',
   '........w.',
   '........w.',
   '..........' ],
],
//--- Level 2 ----------------------------------------------------
[
  ['..........',  // Level 2-1
   '.2......w.',
   '........w.',
   '........w.',
   '........w.',
   '........w.',
   '........w.',
   '.......bw.',
   '.wwwwwwww.',
   '..........' ],
  ['..........',  // Level 2-2
   '........w.',
   '........w.',
   '...2....w.',
   '........w.',
   '........w.',
   '........w.',
   '.......bw.',
   '.wwwwwwww.',
   '..........' ],
  ['..........',  // Level 2-2
   '........w.',
   '........w.',
   '........w.',
   '........w.',
   '........w.',
   '.....2..w.',
   '.......bw.',
   '.wwwwwwww.',
   '..........' ],
],   
//--- Level 3 ----------------------------------------------------
[
  ['..........',  // Level 3-1
   '.w........',
   '.w........',
   '.w......0.',
   '.wxxxxxxx.',
   '.wb.......',
   '.w........',
   '.w........',
   '.w........',
   '..........' ],
  ['..........',  // Level 3-1
   '.w........',
   '.w........',
   '.w....0...',
   '.wxxxxx...',
   '.wb.......',
   '.w........',
   '.w........',
   '.w........',
   '..........' ],
  ['..........',  // Level 3-1
   '.w........',
   '.w........',
   '.w.0......',
   '.wxx......',
   '.wb.......',
   '.w........',
   '.w........',
   '.w........',
   '..........' ],
],   
//--- Level 4 ----------------------------------------------------
[  
  ['..........',  // Level 4-1
   '.wwwwwwww.',
   '.wxxxxxxx.',
   '.wx.....0.',
   '.wx.......',
   '.wx.......',
   '.wx.......',
   '.wx.......',
   '.wx.......',
   '..b.......' ],
  ['..........',  // Level 4-2
   '.wwwww....',
   '.wxxxx....',
   '.wx..0....',
   '.wx.......',
   '.wx.......',
   '..b.......',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 4-3
   '..........',
   '..........',
   '.wwwwwwww.',
   '.wxx......',
   '.wx0......',
   '..b.......',
   '..........',
   '..........',
   '..........' ],
],   
//--- Level 5 ----------------------------------------------------
[  
  ['..........',  // Level 5-1
   '..wwwwww..',
   '....x.....',
   '....x.....',
   '...0x.....',
   '....x.....',
   '....x.....',
   '....xb....',
   '..wwwwww..',
   '..........', ],
  ['..........',  // Level 5-2
   '....w.....',
   '..wwwwww..',
   '....x.....',
   '...0x.....',
   '....x.....',
   '....xb....',
   '..wwwwww..',
   '....w.....',
   '..........', ],
  ['..........',  // Level 5-3
   '....w.....',
   '....w.....',
   '..wwwwww..',
   '...0x.....',
   '....xb....',
   '..wwwwww..',
   '....w.....',
   '....w.....',
   '..........', ],
],   
//--- Level 6 ----------------------------------------------------
[  
  ['..........',  // Level 6-1
   '.b........',
   'wx......xw',
   'wx......xw',
   'wx......xw',
   'wx......xw',
   'wx..2...xw',
   'wxxxxxxxxw',
   'wwwwwwwwww',
   '..........' ],
  ['..........',  // Level 6-2
   '..........',
   '.b........',
   'wx..2...xw',
   'wx......xw',
   'wx......xw',
   'wx......xw',
   'wxxxxxxxxw',
   'wwwwwwwwww',
   '..........' ],
  ['..........',  // Level 6-3
   '..........',
   '...b......',
   '..wx...xw.',
   '..wx..2xw.',
   '..wxxxxxw.',
   '..wwwwwww.',
   '..........',
   '..........',
   '..........' ],
],   
//--- Level 7 ----------------------------------------------------
[
  ['..........',  // Level 7-1
   '.xxxxxxxx.',
   '.xwwwwwwwb',
   '.xw.......',
   '.xw.......',
   '.xw.......',
   '.xw.......',
   '.xwwwwwww0',
   '.xxxxxxxx.',
   '..........' ],
  ['..........',  // Level 7-2
   '..........',
   '..xxxxxx..',
   '..xwwwwwb.',
   '..xw......',
   '..xw......',
   '..xwwwww0.',
   '..xxxxxx..',
   '..........',
   '..........' ],
  ['..........',  // Level 7-3
   '..........',
   '..........',
   '...xxxx...',
   '...xwwwb..',
   '...xw.....',
   '...xwww0..',
   '...xxxx...',
   '..........',
   '..........' ],
],
//--- Level 8 ----------------------------------------------------
[
  ['wwwwwwwwww',  // Level 8-1
   'wxxxxxxxbw',
   'wx......xw',
   'wx......xw',
   'wx......xw',
   'wx..2...xw',
   'wx......xw',
   'wx......xw',
   'wxxxxxxxxw',
   'wwwwwwwwww' ],
  ['..........',  // Level 8-2
   '.wwwwwwww.',  
   '.wxxxxxbw.',
   '.wx....xw.',
   '.wx....xw.',
   '.wx..2.xw.',
   '.wx....xw.',
   '.wxxxxxxw.',
   '.wwwwwwww.',
   '..........' ],
  ['..........',  // Level 8-3
   '..........',
   '..wwwwww..',  
   '..wxxxbw..',
   '..wx2.xw..',
   '..wx..xw..',
   '..wxxxxw..',
   '..wwwwww..',
   '..........',
   '..........' ],
],
//--- Level 9 ----------------------------------------------------
[
  ['.2........',  // Level 9-1
   '..x.......',
   '..xx......',
   '...x......',
   '...xx.....',
   '....x.....',
   '....xx....',
   '.....x....',
   '.....xx.b.',
   '.wwwwwwww.' ],
  ['..........',  // Level 9-2
   '..........',
   '..2.......',
   '...x......',
   '...xx.....',
   '....x.....',
   '....xx.b..',
   '.wwwwwwww.',
   '..........',
   '..........', ],
  ['..........',  // Level 9-3
   '..........',
   '..........',
   '...2......',
   '....x.....',
   '....xx.b..',
   '.wwwwwwww.',
   '..........',
   '..........',
   '..........', ],
],
//--- Level 10 ----------------------------------------------------
[
  ['wwwwwwwwww',  // Level 10-1
   'wxxxxxxxbw',
   'wxxxxxxxxw',
   'wxxxxxxxxw',
   'wxxxxxxxxw',
   'wxxxxxxxXw',
   'wxxxxxxxxw',
   'wxxxxxxxxw',
   'wxxxxxxxxw',
   'wwwwwwwwww' ],
  ['..........',  // Level 10-2
   '.wwwwwwww.',
   '.wxxxxxbw.',
   '.wxxxxxxw.',
   '.wxxxxxxw.',
   '.wxxxxxxw.',
   '.wxxxxxXw.',
   '.wxxxxxxw.',
   '.wwwwwwww.',
   '..........' ],
  ['..........',  // Level 10-2
   '..........',
   '..........',
   '...wwwww..',
   '...wxxbw..',
   '...wxxXw..',
   '...wwwww..',
   '..........',
   '..........',
   '..........' ],
],
];

//======================= BLOCK LIMIT  =======================
// Ограничение на ОБЩЕЕ количество используемых блоков для
// каждого уровня

var BlockLimit = [0, // Level 0 unused
    [4, 5, 6],    // Level 1
    [7, 9, 11],  // Level 2
    [9, 10, 13],  // Level 3
    [11, 13, 15], // Level 4
    [13, 15, 17], // Level 5
    [22, 27, 35], // Level 6
    [23, 28, 35], // Level 7
    [27, 32, 37], // Level 8
    [13, 18, 23], // Level 9
    [24, 29, 35], // Level 10
];

//======================= SOME BLOCKS LIMIT  =======================
// Ограничение на количество используемых блоков ОТДЕЛЬНЫХ ТИПОВ для
// каждого уровня

var someBlocksLimit = [ {}, // Level 0 unused
	{  }, // Level 1
	{  }, // Level 2
	{ 'robot_plant': 1 }, // Level 3
	{ 'robot_plant': 2 }, // Level 4
	{ 'robot_plant': 2 }, // Level 5
	{ 'robot_plant': 3 }, // Level 6
	{ 'robot_plant': 5 }, // Level 7
	{ 'robot_plant': 4 }, // Level 8
	{ 'robot_plant': 3 }, // Level 9
	{ 'robot_plant': 3 }, // Level 10
];

//======================= HELP CONTENT  =======================
// Справочные сообщения, которые появляются перед началом каждого уровня

var HelpContent = [ '', // Level 0 not used
// Level 1   
  '<table><tr><td><img src="./media/while-block.gif" style="margin:10px 15px 0 0;"></td><td>' +
  'Новый блок &laquo;повторять, пока&raquo; позволяет выполнить группу команд ' +
  'несколько раз, пока верно (истинно) условие после слова &laquo;пока&raquo;. ' +
  'Эти команды нужно поставить внутрь блока в правильном порядке.<br> ' +
  '</td></tr></table>' +
  'Тебе нужно написать такое решение задачи, которое будет работать правильно на нескольких ' +
  'полях. С помощью кнопок <img src="./media/prev-icon.png"> и <img src="./media/next-icon.png">, ' +
  'расположенных над полем Робота, можно посмотреть все эти поля.' +
  '<p align="center" style="margin: 5px 0;"><img src="./media/varbuttons.jpg"></p>' +
  '',
// Level 2   
  '',
// Level 3   
  '',
// Level 4   
  '<table><tr><td><img src="./media/whilenot-block.gif" style="margin:10px 15px 0 0;"></td><td>' +
  'В блоке &laquo;повторять, пока&raquo; есть выпадающее меню (см. стрелку). В нём можно выбрать ' +
  'выриант <b>повторять, пока не</b>. В этом случае все будет наоборот: как только ' +
  'выполнится условие после слова &laquo;пока&raquo;, цикл остановится.<br> ' +
  '' +
  '' +
  '</td></tr></table>' +
  '', 
// Level 5   
  '', 
// Level 6   
  '', 
// Level 7   
  '', 
// Level 8   
  '', 
// Level 9   
  '', 
// Level 10   
  '', 
];

//======================= BLOCKLY BLOCKS =======================
// Содержание меню Blockly

function BlocklyBlocks( Level ) {
  if( [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]. includes( Level ) ) return '' + 
  '<xml xmlns="https://developers.google.com/blockly/xml" id="toolbox" style="display: none">' +
  '  <block type="robot_forward_once"></block>' +
  '  <sep gap="1"></sep>' +
  '  <block type="robot_back_once"></block>' +
  '  <sep gap="1"></sep>' +
  '  <block type="robot_left"></block>' +
  '  <sep gap="1"></sep>' +
  '  <block type="robot_right"></block>' +
  '  <sep gap="1"></sep>' +
  '  <block type="robot_plant"></block>' +
  '  <sep gap="20"></sep>' +
  '  <block type="robot_free_forward"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_free_back"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_free_left"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_free_right"></block>' +
  '  <sep gap="20"></sep>' +
  '  <block type="controls_whileUntil"></block>' +
  '</xml>';
  return '';
}
