/**
 * @license
 * Copyright 2020 Константин Поляков
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @fileoverview Робот-Blockly, условные операторы
 * @author kpolyakov@mail.ru (Константин Поляков)
 * @web    kpolyakov.spb.ru
 */

//======================= MAPS =======================
// Карта должна быть размером 10 на 10 клеток
// Условные обозначения:
//    . пустая клетка
//    w стена
//    p клумба с цветами
//    x грядка, в которую нужно посадить цветы
//    0 клетка, в которой находится Робот, смотрит на север 
//    2 клетка, в которой находится Робот, смотрит на восток 
//    4 клетка, в которой находится Робот, смотрит на юг
//    6 клетка, в которой находится Робот, смотрит на запад
//    X клетка-грядка, в которой находится Робот, смотрит на север

	var Maps = 
	 [ [], // Level 0 not used 
	//--- Level 1 ------------------------------------
	 [
	  ['..........',  // Level 1-1
	   '..........',
	   '..........',
	   '..........',
	   '....b.....',
	   '.....0w...',
	   '..........',
	   '..........',
	   '..........',
	   '..........' ],
	  ['..........',  // Level 1-2
	   '..........',
	   '..........',
	   '..........',
	   '..........',
	   '....b0....',
	   '..........',
	   '..........',
	   '..........',
	   '..........' ],
	  ['..........',  // Level 1-3
	   '..........',
	   '..........',
	   '...w..w...',
	   '...wb.w...',
	   '...w.0w...',
	   '...w..w...',
	   '..........',
	   '..........',
	   '..........' ],
	],
	//--- Level 2 ------------------------------------
	[   
  ['..........',  // Level 2-1
   '..........',
   '..........',
   '.....ww...',
   '....b0....',
   '.....ww...',
   '..........',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 2-2
   '..........',
   '..........',
   '....wwww..',
   '...b.0....',
   '....wwww..',
   '..........',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 2-3
   '..........',
   '..........',
   '....wwww..',
   '...b.0....',
   '..........',
   '..........',
   '..........',
   '..........',
   '..........' ],
],
//--- Level 3 ------------------------------------
[   
  ['..........',  // Level 3-1
   '..........',
   '..........',
   '...w6w....',
   '...w.w....',
   '....b.....',
   '..........',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 3-2
   '..........',
   '..........',
   '...w6w....',
   '...w.w....',
   '...w.w....',
   '....b.....',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 3-3
   '..........',
   '..........',
   '...w6w....',
   '...w.w....',
   '.....w....',
   '.....w....',
   '....b.....',
   '..........',
   '..........' ],
],
//--- Level 4 ------------------------------------
[   
  ['..........',  // Level 4-1
   '..........',
   '..........',
   '..........',
   '..wwwww...',
   '..bx0.....',
   '..........',
   '..wwwww...',
   '..........',
   '..........' ],
  ['..........',  // Level 4-2
   '..........',
   '..........',
   '..........',
   '..bx0.....',
   '..........',
   '..wwwww...',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 4-3
   '..........',
   '..........',
   '..........',
   '....0xb...',
   '..wwwww...',
   '..........',
   '..........',
   '..........',
   '..........' ],
],
//--- Level 5 ------------------------------------
[   
  ['..........',  // Level 5-1
   '..........',
   '....b......',
   '...wxwww..',
   '...wxxXw..',
   '...wwwww..',
   '..........',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 5-2
   '..........',
   '......b...',
   '...wwwxw..',
   '...wxxXw..',
   '...wwwww..',
   '..........',
   '..........',
   '..........',
   '..........' ],
],
//--- Level 6 ------------------------------------
[   
  ['..........',  // Level 6-1
   '..........',
   '..........',
   '....b.....',
   '...w.www..',
   '...w..0w..',
   '...wwwww..',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 6-2
   '..........',
   '..........',
   '......b...',
   '...www.w..',
   '...w..0w..',
   '...wwwww..',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 6-3
   '..........',
   '..........',
   '...wwwww..',
   '...w..0w..',
   '...w.www..',
   '....b.....',
   '..........',
   '..........',
   '..........' ],
],
//--- Level 7 ------------------------------------
[   
  ['..........',  // Level 7-1
   '..........',
   '..........',
   '..........',
   '..wbwwww..',
   '..wx.0....',
   '..wwwwww..',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 7-2
   '..........',
   '..........',
   '..........',
   '..wwwwww..',
   '..wx.0....',
   '..wbwwww..',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 7-3
   '..........',
   '..........',
   '..wwwwbw..',
   '..w..0xw..',
   '..wwwwww..',
   '..........',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 7-4
   '..........',
   '..........',
   '..wwwwww..',
   '..w..0xw..',
   '..wwwwbw..',
   '..........',
   '..........',
   '..........',
   '..........' ],
],
//--- Level 9 ------------------------------------
[   
  ['..........',  // Level 8-1
   '..........',
   '..........',
   '.....4....',
   '..www.www.',
   '..www...w.',
   '..wwwww.w.',
   '.......b..',
   '..........',
   '..........' ],
  ['..........',  // Level 8-2
   '..........',
   '..........',
   '.....4....',
   '..www.www.',
   '..w...www.',
   '..w.wwwww.',
   '...b......',
   '..........',
   '..........' ],
  ['..........',  // Level 8-3
   '..........',
   '..........',
   '.....4....',
   '..www.www.',
   '..www.www.',
   '..www.www.',
   '....w..b..',
   '..........',
   '..........' ],
  ['..........',  // Level 8-4
   '..........',
   '..........',
   '.....4....',
   '..www.www.',
   '..www.www.',
   '..www.www.',
   '...b..w...',
   '..........',
   '..........' ],
],
//--- Level 9 ------------------------------------
[   
  ['..........',  // Level 9-1
   '..........',
   '...b......',
   '..w.wwww..',
   '..w..xww..',
   '..www.ww..',
   '..wx..ww..',
   '..w0wwww..',
   '..........',
   '..........' ],
  ['..........',  // Level 9-2
   '..........',
   '..........',
   '..wwwwww..',
   '..wwwx.b..',
   '..www.ww..',
   '..wx..ww..',
   '..w0wwww..',
   '..........',
   '..........' ],
  ['..........',  // Level 9-3
   '..........',
   '..........',
   '..wwwwww..',
   '..wwwwww..',
   '..www.ww..',
   '..bx..xw..',
   '..wwww0w..',
   '..........',
   '..........' ],
  ['..........',  // Level 9-4
   '..........',
   '..........',
   '..wwwbww..',
   '..wwwxww..',
   '..www.ww..',
   '..ww..xw..',
   '..wwww0w..',
   '..........',
   '..........' ],
],
//--- Level 10 ------------------------------------
[   
  ['..........',  // Level 10-1
   '..........',
   '......b...',
   '.wwwww.ww.',
   '.www...ww.',
   '.w...wwww.',
   '.2.wwwwww.',
   '.wwwwwwww.',
   '..........',
   '..........' ],
  ['..........',  // Level 10-2
   '..........',
   '..........',
   '.wwwwwwww.',
   '.www...ww.',
   '.w...w.ww.',
   '.2.wwwbww.',
   '.wwwwwwww.',
   '..........',
   '..........' ],
  ['..........',  // Level 10-3
   '..........',
   '..........',
   '.wwwwwwww.',
   '.wwwwwbww.',
   '.w...w.ww.',
   '.2.w...ww.',
   '.wwwwwwww.',
   '..........',
   '..........' ],
  ['..........',  // Level 10-4
   '..........',
   '..........',
   '.wwwwwwww.',
   '.wwwwwwww.',
   '.w...wwww.',
   '.2.w...ww.',
   '.wwwww.ww.',
   '......b...',
   '..........' ],
  ['..........',  // Level 10-5
   '..........',
   '......b...',
   '.wwwww.ww.',
   '.2.w...ww.',
   '.w...wwww.',
   '.wwwwwwww.',
   '.wwwwwwww.',
   '..........',
   '..........' ],
  ['..........',  // Level 10-6
   '..........',
   '..........',
   '.wwwwwwww.',
   '.2.w...ww.',
   '.w...w.ww.',
   '.wwwwwbww.',
   '.wwwwwwww.',
   '..........',
   '..........' ],
  ['..........',  // Level 10-7
   '..........',
   '..........',
   '.wwwwwwww.',
   '.2.wwwbww.',
   '.w...w.ww.',
   '.www...ww.',
   '.wwwwwwww.',
   '..........',
   '..........' ],
  ['..........',  // Level 10-8
   '..........',
   '..........',
   '.wwwwwwww.',
   '.2.wwwwww.',
   '.w...wwww.',
   '.www...ww.',
   '.wwwww.ww.',
   '......b...',
   '..........' ],
],
];

//======================= BLOCK LIMIT  =======================
// Ограничение на ОБЩЕЕ количество используемых блоков для
// каждого уровня

var BlockLimit = [0, // Level 0 unused
    [5, 7, 9],    // Level 1
    [5, 7, 10],   // Level 2
    [9, 12, 15],  // Level 3
    [11, 14, 17],  // Level 4
    [18, 21, 28],   // Level 5
    [14, 17, 23],  // Level 6
    [19, 25, 30],   // Level 7
    [24, 28, 35],  // Level 8
    [34, 40, 45],  // Level 9
    [27, 35, 45],  // Level 10
    ];

//======================= SOME BLOCKS LIMIT  =======================
// Ограничение на количество используемых блоков ОТДЕЛЬНЫХ ТИПОВ для
// каждого уровня

var someBlocksLimit = [ {}, // Level 0 unused
	{  }, // Level 1
	{  }, // Level 2
	{  }, // Level 3
	{  }, // Level 4
	{  }, // Level 5
	{  }, // Level 6
	{  }, // Level 7
	{  }, // Level 8
	{  }, // Level 9
	{  }, // Level 10
];

//======================= HELP CONTENT  =======================
// Справочные сообщения, которые появляются перед началом каждого уровня

var HelpContent = [ '', // Level 0 not used
// Level 1   
  '<table><tr><td><img src="./media/if-block.gif" style="margin:10px 15px 0 0;"></td><td>' +
  'Новый блок &laquo;если&raquo; позволяет выполнить группу команд только в том случае, ' +
  'когда верно (истинно) условие после слова &laquo;если&raquo;. ' +
  'Эти команды нужно поставить внутрь блока в правильном порядке.<br> ' +
  '</td></tr></table>' +
  'Тебе нужно написать такое решение задачи, которое будет работать правильно на нескольких ' +
  'полях. С помощью кнопок <img src="./media/prev-icon.png"> и <img src="./media/next-icon.png">, ' +
  'расположенных над полем Робота, можно посмотреть все эти поля.' +
  '<p align="center" style="margin: 5px 0;"><img src="./media/varbuttons.jpg"></p>' +
  '',
// Level 2   
  '',
// Level 3   
  '',
// Level 4   
  '', 
// Level 5   
  '', 
// Level 6   
  '', 
// Level 7   
  '<table><tr><td><img src="./media/ifif-block.gif" style="margin:10px 15px 0 0;"></td><td>' +
  'Внутри блок &laquo;если&raquo; можно использовать ещё один блок &laquo;если&raquo;, так ' +
  'как показано на рисунке слева. Второй блок &laquo;если&raquo; можно установить и ' +
  'после слова &laquo;иначе&raquo;. Попробуй использовать эти приёмы.' +
  '</td></tr></table>' +
  '', 
// Level 8   
  '', 
// Level 9   
  '', 
// Level 10   
  '', 
// Level 11   
  '', 
// Level 12   
  '', 
];

//======================= BLOCKLY BLOCKS =======================
// Содержание меню Blockly

function BlocklyBlocks( Level ) {
  if( [1, 2, 3, 4]. includes( Level ) ) return '' + 
  '<xml xmlns="https://developers.google.com/blockly/xml" id="toolbox" style="display: none">' +
  '<category name="Робот" colour="%{BKY_ROBOT_HUE}">' +
  '  <block type="robot_forward_once"></block>' +
  '  <block type="robot_back_once"></block>' +
  '  <block type="robot_left"></block>' +
  '  <block type="robot_right"></block>' +
  '  <block type="robot_plant"></block>' +
  '</category>' +
  '<category name="Датчики" colour="%{BKY_CONDITION_HUE}">' +
  '  <block type="robot_free_forward"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_free_back"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_free_left"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_free_right"></block>' +
  '  <sep gap="20"></sep>' +
  '  <block type="robot_wall_forward"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_wall_back"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_wall_left"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_wall_right"></block>' +
  '</category>' +
  '<category name="Логика" colour="%{BKY_LOGIC_HUE}">' +
  '  <block type="controls_if"></block>' +
  //'  <block type="logic_negate"></block>' +
  '</category>' +
  '</xml>';
  if( [5, 6, 7, 8, 9, 10, 11, 12]. includes( Level ) ) return '' + 
  '<xml xmlns="https://developers.google.com/blockly/xml" id="toolbox" style="display: none">' +
  '<category name="Робот" colour="%{BKY_ROBOT_HUE}">' +
  '  <block type="robot_forward_once"></block>' +
  '  <block type="robot_back_once"></block>' +
  '  <block type="robot_left"></block>' +
  '  <block type="robot_right"></block>' +
  '  <block type="robot_plant"></block>' +
  '</category>' +
  '<category name="Датчики" colour="%{BKY_CONDITION_HUE}">' +
  '  <block type="robot_free_forward"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_free_back"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_free_left"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_free_right"></block>' +
  '  <sep gap="20"></sep>' +
  '  <block type="robot_wall_forward"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_wall_back"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_wall_left"></block>' +
  '  <sep gap="5"></sep>' +
  '  <block type="robot_wall_right"></block>' +
  '</category>' +
  '<category name="Логика" colour="%{BKY_LOGIC_HUE}">' +
  '  <block type="controls_if"></block>' +
  '  <block type="controls_if">' +
  '    <mutation else="1"></mutation>' +
  '  </block>' +   
//'  <block type="logic_negate"></block>' +
  '</category>' +
  '</xml>';
  return '';
}

