/**
 * @license
 * Copyright 2020 Константин Поляков
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @fileoverview Робот-Blockly, циклы N раз
 * @author kpolyakov@mail.ru (Константин Поляков)
 * @web    kpolyakov.spb.ru
 */

//======================= MAPS =======================
// Карта должна быть размером 10 на 10 клеток
// Условные обозначения:
//    . пустая клетка
//    w стена
//    p клумба с цветами
//    x грядка, в которую нужно посадить цветы
//    0 клетка, в которой находится Робот, смотрит на север 
//    2 клетка, в которой находится Робот, смотрит на восток 
//    4 клетка, в которой находится Робот, смотрит на юг
//    6 клетка, в которой находится Робот, смотрит на запад
//    X клетка-грядка, в которой находится Робот, смотрит на север

var Maps = 
 [ [], // Level 0   
  ['..........',  // Level 1
   '..........',
   '..........',
   '..........',
   '.2xxxxxb..',
   '..........',
   '..........',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 2
   '.....2....',
   '..........',
   '..........',
   '..xxxxxx..',
   '..........',
   '..........',
   '....b.....',
   '..........',
   '..........' ],
  ['..........',  // Level 3
   '....x.....',
   '..........',
   '...bx0....',
   '..........',
   '....x.....',
   '..........',
   '....x.....',
   '..........',
   '..........' ],
  ['..........',  // Level 4
   '..........',
   '..........',
   '..........',
   '..xwxwxw0.',
   '........b.',
   '..........',
   '..........',
   '..........',
   '..........' ],
  ['..........',  // Level 5
   '..b....0..',
   '..wwwwww..',
   '....x.....',
   '..wwwwww..',
   '....x.....',
   '..wwwwww..',
   '....x.....',
   '..........',
   '..........' ],
  ['..........',  // Level 6
   '..b....xw.',
   '.......xw.',
   '.......xw.',
   '.......xw.',
   '.......xw.',
   '......0xw.',
   '.xxxxxxxw.',
   '.wwwwwwww.',
   '..........' ],
  ['..........',  // Level 7
   '..xxxxxxx.',
   '..xwwwwwwb',
   '..xw......',
   '..xw......',
   '..xw......',
   '..xw......',
   '..xwwwwww.',
   '..xxxxxxx.',
   '..0.......' ],
  ['..........',  // Level 8
   '...xw.....',
   '.2.xx.....',
   '.b.wxw....',
   '....xx....',
   '....wxw...',
   '.....xx...',
   '.....wxw..',
   '......xx..',
   '..........' ],
  ['..........',  // Level 9
   '..........',
   '..xxxxxxb.',
   '..xxxxxx..',
   '..xxxxxx..',
   '..xxxxxx..',
   '..xxxxxx..',
   '..........',
   '....0.....',
   '..........' ],
  ['..........',  // Level 10
   '.4xw......', 
   '..xwxw..b.', 
   '..xwxwxw..', 
   '..xwxwxw..', 
   '..xwxwxw..', 
   '..xwxwxw..', 
   '....xwxw..', 
   '......xw..', 
   '..........' ],
];

//======================= BLOCK LIMIT  =======================
// Ограничение на ОБЩЕЕ количество используемых блоков для
// каждого уровня

var BlockLimit = [0, // Level 0 unused
    [5, 6, 7],  // Level 1
    [12, 15, 18],   // Level 2
    [12, 15, 18],   // Level 3
    [11, 14, 17],  // Level 4
    [15, 18, 23],  // Level 5
    [17, 20, 25],  // Level 6
    [20, 25, 30],  // Level 7 
    [20, 25, 30],   // Level 8
    [20, 25, 30],   // Level 9
    [20, 25, 30],    // Level 10
     ];

//======================= SOME BLOCKS LIMIT  =======================
// Ограничение на количество используемых блоков ОТДЕЛЬНЫХ ТИПОВ для
// каждого уровня

var someBlocksLimit = [ {}, // Level 0 unused
	{ 'robot_plant': 1 }, // Level 1
	{ 'robot_plant': 1 }, // Level 2
	{ 'robot_plant': 1 }, // Level 3
	{ 'robot_plant': 1 }, // Level 4
	{ 'robot_plant': 1 }, // Level 5
	{ 'robot_plant': 2 }, // Level 6
	{ 'robot_plant': 3 }, // Level 7
	{ 'robot_plant': 3 }, // Level 8
	{ 'robot_plant': 1 }, // Level 9
	{ 'robot_plant': 1 }, // Level 10
];

//======================= HELP CONTENT  =======================
// Справочные сообщения, которые появляются перед началом каждого уровня

var HelpContent = [ '', // Level 0 not used
// Level 1   
  '<table><tr><td><img src="./media/ntimes-block.gif" style="margin:10px 15px 0 0;"></td><td>' +
  'Новый блок &laquo;повторить&raquo; позволяет выполнить группу команд ' +
  'несколько раз. Эти команды нужно поставить внутрь блока в правильном порядке.' +
  '' +
  '' +
  '' +
  '</td></tr></table>' +
  '',
// Level 2   
  '',
// Level 3   
  '',
// Level 4   
  '', 
// Level 5   
  '', 
// Level 6   
  '', 
// Level 7   
  '', 
// Level 8   
  '', 
// Level 9   
  '', 
// Level 10   
  '', 
];

//======================= BLOCKLY BLOCKS =======================
// Содержание меню Blockly

function BlocklyBlocks( Level ) {
  if( [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]. includes( Level ) ) return '' + 
  '<xml xmlns="https://developers.google.com/blockly/xml" id="toolbox" style="display: none">' +
  '  <block type="robot_forward"></block>' +
  '  <block type="robot_back"></block>' +
  '  <block type="robot_left"></block>' +
  '  <block type="robot_right"></block>' +
  '  <block type="robot_plant"></block>' +
  '  <block type="controls_repeat_list">' +
  '  </block>' +
//  '  <block type="controls_repeat_ext">' +
//  '    <value name="TIMES">' +
//  '      <shadow type="math_number">' +
//  '        <field name="NUM">2</field>' +
//  '      </shadow>' +
//  '    </value>' +
//  '  </block>' +
  '</xml>';
  return '';
}
